List<String> indexDigits = [
  '१',  // 1 (Ek)
  '२',  // 2 (Do)
  '३',  // 3 (Teen)
  '४',  // 4 (Chaar)
  '५',  // 5 (Paanch)
  '६',  // 6 (Chhah)
  '७',  // 7 (Saat)
  '८',  // 8 (Aath)
  '९',  // 9 (Nau)
  '१०', // 10 (Das)
  '११', // 11 (Gyarah)
  '१२', // 12 (Barah)
  '१३', // 13 (Terah)
  '१४', // 14 (Chaudah)
  '१५', // 15 (Pandrah)
  '१६', // 16 (Solah)
  '१७', // 17 (Satrah)
  '१८', // 18 (Atharah)
  '१९', // 19 (Unnees)
  '२०', // 20 (Bees)
  '२१', // 21 (Ikkis)
  '२२', // 22 (Baees)
  '२३', // 23 (Teis)
  '२४', // 24 (Chaubees)
  '२५', // 25 (Pachchees)
  '२६', // 26 (Chhabbees)
  '२७', // 27 (Sattais)
  '२८', // 28 (Atthais)
  '२९', // 29 (Untees)
  '३०', // 30 (Tees)
  '३१', // 31 (Ikatees)
  '३२', // 32 (Battees)
  '३३', // 33 (Taintees)
  '३४', // 34 (Chauntees)
  '३५', // 35 (Paintees)
  '३६', // 36 (Chhattees)
  '३७', // 37 (Saaintees)
  '३८', // 38 (Adatees)
  '३९', // 39 (Untaalees)
  '४०', // 40 (Chaalees)
];

List<String> hindiOrdinals = [
  'पहला', 'दूसरा', 'तीसरा', 'चौथा', 'पांचवा', 'छठा', 'सातवां', 'आठवां', 'नौवां', 'दसवां',
  'ग्यारहवां', 'बारहवां', 'तेरहवां', 'चौदहवां', 'पंद्रहवां', 'सोलहवां', 'सत्रहवां', 'अठारहवां', 'उन्नीसवां', 'बीसवां',
  'इक्कीसवां', 'बाईसवां', 'तेईसवां', 'चौबीसवां', 'पच्चीसवां', 'छब्बीसवां', 'सत्ताईसवां', 'अट्ठाईसवां', 'उनतीसवां', 'तीसवां',
  'इकतीसवां', 'बत्तीसवां', 'तैंतीसवां', 'चौंतीसवां', 'पैंतीसवां', 'छत्तीसवां', 'सैंतीसवां', 'अड़तीसवां', 'उनतालीसवां', 'चालीसवां'
];